snlkuharlocal/src/Documents/КоллективныеРаботы/КоллективныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоллективныеРаботы</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЛистЗагрузки</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриостановкаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозобновлениеРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтрокДокОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловекоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыВыполняемыхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.ЛистМаркировкиОстатков</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ЛистЗагрузки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаузаВРаботе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояДоВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыЧистое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БригадаСформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>CatalogRef.ВидыВыполняемыхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПаузы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьПаузы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВедущийСотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ЗаданиеНабора</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.ЛистЗагрузки</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/КоллективныеРаботы/ManagerModule.bsl
// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6079
#Область ПоискФизлицПоШтрихКодуГруппы

Функция ПоискФизлицПоШтрихКодуГруппы(ШтрихКод, ЧислоСотрудников = 1) Экспорт
	
	ЧислоСотрудников = ?(ЧислоСотрудников = 0, 1, ЧислоСотрудников);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка КАК Группа
	|ПОМЕСТИТЬ вр_Группа
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа
	|	И НЕ ФизическиеЛица.ПометкаУдаления
	|	И ФизическиеЛица.ШтрихКод = &ШтрихКод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ " + Строка(Окр(ЧислоСотрудников,0)) + "
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ИЗ
	|	вр_Группа КАК вр_Группа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО вр_Группа.Группа = ФизическиеЛица.Родитель
	|ГДЕ
	|	НЕ ФизическиеЛица.ЭтоГруппа
	|	И НЕ ФизическиеЛица.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивФизлиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивФизлиц;

КонецФункции

#КонецОбласти
// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6079

// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область Интерфейс

Функция НайтиКоличествоКомплектующих(тзТовары) Экспорт
	
	Если тзТовары.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО(10, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	&тзТовары КАК тзТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Товары.Номенклатура КАК Номенклатура,
	|	вр_Товары.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(вр_Товары.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ вр_Таблица
	|ИЗ
	|	вр_Товары КАК вр_Товары
	|ГДЕ
	|	вр_Товары.Номенклатура.ВидКомплекта В (ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Комплектующие.Ссылка,
	|	Комплектующие.Номенклатура,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) * ЕСТЬNULL(вр_Товары.Количество, 0)
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
	|		ПО Комплектующие.Ссылка = вр_Товары.Номенклатура
	|ГДЕ
	|	Комплектующие.Ссылка.ВидКомплекта В (ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вр_Таблица.Количество) КАК Количество
	|ИЗ
	|	вр_Таблица КАК вр_Таблица";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПреобразоватьШтрихкодыУпаковокВТовары(тзШтрихкодыУпаковок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК Штрихкод
	|ПОМЕСТИТЬ вр_Штрихкоды
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Штрихкоды.Штрихкод.Владелец КАК Номенклатура,
	|	вр_Штрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ т_Штрихкоды
	|ИЗ
	|	вр_Штрихкоды КАК вр_Штрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т_Штрихкоды.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(т_Штрихкоды.Штрихкод) КАК Количество
	|ИЗ
	|	т_Штрихкоды КАК т_Штрихкоды
	|
	|СГРУППИРОВАТЬ ПО
	|	т_Штрихкоды.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	тзВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзВыборка;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976

// Шворобей ВЮ 29.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область ПоискНезакрытыхКоллективныхРабот

Функция ПоискНезакрытыхКоллективныхРаботПоДокументуОснования(ДокОснование) Экспорт
	
	МассивКР = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	Запрос.УстановитьПараметр("ДатаЗапретаРедактирование", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КоллективныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоллективныеРаботы КАК КоллективныеРаботы
	|ГДЕ
	|	КоллективныеРаботы.ДокОснование = &ДокОснование
	|	И КоллективныеРаботы.Проведен
	|	И НЕ КоллективныеРаботы.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена), ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Принята))
	|	И КоллективныеРаботы.Дата > &ДатаЗапретаРедактирование
	|	И КоллективныеРаботы.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		МассивКР.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивКР;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 29.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
